#!/bin/bash
# 这是一个查询主机名称、CPU型号、CPU物理核数、超线程数vCPU、内存大小、GPU型号、
# 操作系统、Linux内核版本 的脚本程序
# 查询 网卡、mac地址、IP地址请直接执行 ifconfig 命令
echo "=================================================================================="
echo "主机名称"
hostname
echo " "

echo "=================================================================================="
echo "CPU个数"
cat /proc/cpuinfo| grep "physical id"| sort| uniq| wc -l
echo " "

echo "=================================================================================="
echo "CPU型号"
cat /proc/cpuinfo | grep 'model name' |uniq
echo " "

echo "=================================================================================="
echo "CPU核数"
cat /proc/cpuinfo | grep "cpu cores" | uniq
echo " "

echo "=================================================================================="
echo "vCPU超线程数"
cat /proc/cpuinfo| grep "processor"| wc -l
echo " "

echo "=================================================================================="
echo "内存大小"
free -g
echo " "

echo "=================================================================================="
echo "GPU型号"
lspci | grep 'NVIDIA'
echo " "

echo "=================================================================================="
echo "操作系统 "
head -n 1 /etc/issue
echo " "

echo "=================================================================================="
echo "Linux内核版本"
cat /proc/version
echo " "

echo "=================================================================================="
echo "硬盘序列号"
# sudo fdisk -l 
sudo fdisk -l | sed '1,5d' | sed '2,12d' | awk -F: '{print $2}'